app/controllers/home_controller.rb

  def result
    if request.path_info != session[:ref]
      session[:ref] = request.path_info
      @top_page = root_url(only_path: false)
      sentence = Sentence.new(content: params[:content])
      @num = 0
      @nensyu = nil
      @message1 = nil
      @message2 = nil
      @message3 = nil
      count = 0
      words = Word.all
      simoneta = ['にゃーん', 'おっぱい', 'ちんちん']

      if sentence.content.length == 0
        redirect_to controller: :home, action: :index
      end

      words.each do |word|
---
SELECT "words".* FROM "words"