app/controllers/words_controller.rb

SELECT "words".* FROM "words" ORDER BY "words"."id" DESC
---
  def index
    @words = Word.all.order(id: :asc)

INSERT INTO "words" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "繋がりたい"], ["created_at", "2021-08-22 14:59:23.286107"], ["updated_at", "2021-08-22 14:59:23.286107"]]
---
  def create
    @word = Word.new(content: params[:content])
    if @word.save

SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "words" WHERE "words"."id" = ?  [["id", 3]]
---
  def destroy
    @word = Word.find_by(id: params[:id])
    @word.destroy